/***********************************************************************
 *
 *   ゲーム起動時からの経過時間を計るクラス.
 *
***********************************************************************/

class GameTimer
{
    static #timeSum    = 0;          // number: 起動時からの経過時間.
    static #lastUpdate = Date.now(); // number: 最後に時間を取得した時間.
    static #isPause    = false;      // bool:   ポーズ中なら true.


    /*-----------------------------------------------------------------+
    *
    * 説明: 経過時間の更新.
    *
    +-----------------------------------------------------------------*/
    static Update()
    {
        const now = Date.now();
        if (!this.#isPause) this.#timeSum += now - this.#lastUpdate;
        this.#lastUpdate = now;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 経過時間を取得する.
    *
    * 戻り値:
    *   number: ゲーム起動時からの経過時間(ms).
    *
    +-----------------------------------------------------------------*/
    static GetTime()
    {
        return this.#timeSum;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 時間計測を一時停止する.
    *
    +-----------------------------------------------------------------*/
    static Pause()
    {
        this.#isPause = true;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 時間計測の一時停止を解除する.
    *
    +-----------------------------------------------------------------*/
    static UnPause()
    {
        this.#isPause = false;
    }
}