/***********************************************************************
 *
 *   ゲームのフレーム更新処理を行うクラス.
 *
***********************************************************************/

class GameTick
{
    #tickEvent; // SimpleEvent:  定期的にtickイベントを発行する.


    /*-----------------------------------------------------------------+
    *
    * 説明: コンストラクタ.
    *
    * 引数:
    *   number tickCount: 1秒間に行うフレーム更新の回数.
    *
    +-----------------------------------------------------------------*/
    constructor(tickCount)
    {
        this.#tickEvent = new SimpleEvent();
        const interval = 1000 / tickCount;

        setInterval(
            this.#tickEvent.Invoke.bind(this.#tickEvent),
            interval
        );
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: フレーム更新時に呼び出すコールバックを登録する.
    *
    * 引数:
    *   function callback: コールバック.
    *
    +-----------------------------------------------------------------*/
    Subscribe(callback)
    {
        this.#tickEvent.Add(callback);
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: フレーム更新時に呼び出すコールバックの登録を解除する.
    *
    * 引数:
    *   function callback: コールバック.
    *
    +-----------------------------------------------------------------*/
    UnSubscribe(callback)
    {
        this.#tickEvent.Remove(callback);
    }
}