/***********************************************************************
 *
 * 　2次元の矩形を表す構造体.
 *
***********************************************************************/

class Rect
{
    #top;    // number: 矩形の上辺のY座標.
    #left;   // number: 矩形の左辺のX座標.
    #bottom; // number: 矩形の下辺のY座標.
    #right;  // number: 矩形の右辺のX座標.


    /*-----------------------------------------------------------------+
    *
    * 説明: コンストラクタ.
    *
    * 引数:
    *   number  top:     矩形の上辺のY座標.
    *   number  left:    矩形の左辺のX座標.
    *   number  bottom:  矩形の下辺のY座標.
    *   number  right:   矩形の右辺のX座標.
    *
    +-----------------------------------------------------------------*/
    constructor(top, left, bottom, right)
    {
        this.#top    = top;
        this.#left   = left;
        this.#bottom = bottom;
        this.#right  = right;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 矩形の上辺のY座標を取得する.
    *
    * 戻り値:
    *   number: 矩形の上辺のY座標.
    *
    +-----------------------------------------------------------------*/
    Top()
    {
        return this.#top;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 矩形の左辺のX座標を取得する.
    *
    * 戻り値:
    *   number: 矩形の左辺のX座標.
    *
    +-----------------------------------------------------------------*/
    Left()
    {
        return this.#left;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 矩形の下辺のY座標を取得する.
    *
    * 戻り値:
    *   number: 矩形の下辺のY座標.
    *
    +-----------------------------------------------------------------*/
    Bottom()
    {
        return this.#bottom;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 矩形の右辺のX座標を取得する.
    *
    * 戻り値:
    *   number: 矩形の右辺のX座標.
    *
    +-----------------------------------------------------------------*/
    Right()
    {
        return this.#right;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 矩形の上辺のY座標を設定する.
    *
    * 引数:
    *   number  top:  矩形の上辺のY座標.
    *
    +-----------------------------------------------------------------*/
    Top(top)
    {
        this.#top = top;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 矩形の左辺のX座標を設定する.
    *
    * 引数:
    *   number  left:  矩形の左辺のX座標.
    *
    +-----------------------------------------------------------------*/
    Left(left)
    {
        this.#left = left;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 矩形の下辺のY座標を設定する.
    *
    * 引数:
    *   number  bottom:  矩形の下辺のY座標.
    *
    +-----------------------------------------------------------------*/
    Bottom(bottom)
    {
        this.#bottom = bottom;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 矩形の右辺のX座標を設定する.
    *
    * 引数:
    *   number  right:  矩形の右辺のX座標.
    *
    +-----------------------------------------------------------------*/
    Right(right)
    {
        this.#right = right;
    }
}