/***********************************************************************
 *
 *   削除された行数をカウントするクラス.
 *
***********************************************************************/

class LineCounter
{
    #deletedLines; // number: 削除済みの行数.


    /*-----------------------------------------------------------------+
    *
    * 説明: コンストラクタ.
    *
    +-----------------------------------------------------------------*/
    constructor()
    {
        this.#deletedLines = new Counter();
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: カウントする.
    *
    * 引数:
    *   number deletedLineCount: カウントする数.
    *
    +-----------------------------------------------------------------*/
    Count(deletedLineCount)
    {
        this.#deletedLines.CountUp(deletedLineCount);
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 削除された行数を取得する.
    *
    * 戻り値:
    *   number: 削除された行数.
    *
    +-----------------------------------------------------------------*/
    GetDeletedLineCount()
    {
        return this.#deletedLines.GetValue();
    }
}