/***********************************************************************
 *
 *   左右キー長押し時の自動連打までのディレイ(DAS)を管理するクラス.
 *   AutoRepeatRate クラスとセットで使う.
 *
 *   参考: https://nestetrisjp.github.io/das-introduction/
 *
***********************************************************************/

class DelayerAutoShift
{
    #delay;        // number: 自動連打までのディレイ(ms).
    #lastPushTime; // number: 最後にキーが押された時間(ms).
    #isHold;       // bool:   キーが長押しされているなら true.


    /*-----------------------------------------------------------------+
    *
    * 説明: コンストラクタ.
    *
    * number delayMilliSecond: 自動連打までのディレイ(ms).
    *
    +-----------------------------------------------------------------*/
    constructor(delayMilliSecond)
    {
        this.#delay        = delayMilliSecond;
        this.#lastPushTime = 0;
        this.#isHold       = false;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: このメソッドが呼ばれた際に ARR ができる状態なら true を返す.
    *
    * 戻り値:
    *   bool: ARR ができる状態なら true.
    *
    +-----------------------------------------------------------------*/
    Enable()
    {
        if (!this.#isHold) return false;

        const holdTime = GameTimer.GetTime() - this.#lastPushTime;
        return this.#delay <= holdTime;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 長押し判定を開始する.
    *
    +-----------------------------------------------------------------*/
    OnPush()
    {
        this.#lastPushTime = GameTimer.GetTime();
        this.#isHold       = true;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 長押し判定を終了する.
    *
    +-----------------------------------------------------------------*/
    OnPull()
    {
        this.#isHold = false;
    }
}