/***********************************************************************
 *
 *   9スライスのインデックスを計算するクラス.
 *
***********************************************************************/

class NineSliceIndex
{
    #width;  // number: 塗りつぶす矩形の幅.
    #height; // number: 塗りつぶす矩形の高さ.


    /*-----------------------------------------------------------------+
    *
    * 説明: コンストラクタ.
    *
    * 引数:
    *   number width:  塗りつぶす矩形の幅.
    *   number height: 塗りつぶす矩形の高さ.
    *
    +-----------------------------------------------------------------*/
    constructor(width, height)
    {
        this.#width  = width  - 1;
        this.#height = height - 1;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 座標からインデックスを取得する.
    *
    * 引数:
    *   number x:  描画する位置のX座標.
    *   number y:  描画する位置のY座標.
    *
    +-----------------------------------------------------------------*/
    GetIndex(x, y)
    {
        if (y === 0)
        {
            if (x === 0) return 0;
            if (x === this.#width) return 2;
            return 1;
        }

        if (y === this.#height)
        {
            if (x === 0) return 6;
            if (x === this.#width) return 8;
            return 7;
        }

        if (x === 0) return 3;
        if (x === this.#width) return 5;
        return 4;
    }
}