/***********************************************************************
 *
 *   テトリミノのホールドを行うクラス.
 *
***********************************************************************/

class TetriMinoHolder
{
    #tetriMinoName; // string: テトリミノの名前.
    #isSwappable;   // bool:   スワップ可能かどうか.


    /*-----------------------------------------------------------------+
    *
    * 説明: コンストラクタ.
    *
    +-----------------------------------------------------------------*/
    constructor()
    {
        this.#tetriMinoName = null;
        this.#isSwappable = true;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: テトリミノをホールドする.
    *
    * 引数:
    *   string tetriMinoName: このテトリミノの名前.
    *
    * 戻り値:
    *   string | null: テトリミノの名前.
    *
    +-----------------------------------------------------------------*/
    Hold(tetriMinoName)
    {
        this.#isSwappable = false;
        const result = this.#tetriMinoName;
        this.#tetriMinoName = tetriMinoName;
        return result;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: スワップ可能かどうかを取得する.
    *
    * 戻り値:
    *   bool: スワップ可能なら true.
    *
    +-----------------------------------------------------------------*/
    IsSwappable()
    {
        return this.#isSwappable;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: スワップ可能な状態にする.
    *
    +-----------------------------------------------------------------*/
    ResetSwappable()
    {
        this.#isSwappable = true;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: ホールド中のテトリミノの名前を取得する.
    *
    * 戻り値:
    *   string: このテトリミノの名前.
    *
    +-----------------------------------------------------------------*/
    GetHoldingMinoName()
    {
        return this.#tetriMinoName;
    }
}