/***********************************************************************
 *
 *   物理ボタンのイベントを纏めたクラス.
 *
***********************************************************************/

class PhysicalButtonEvent
{
    #onPush; // SimpleEvent: 押された時1回呼ばれる.
    #onHold; // SimpleEvent: 押されている間呼ばれる.
    #onPull; // SimpleEvent: 離された時1回呼ばれる.


    /*-----------------------------------------------------------------+
    *
    * 説明: コンストラクタ.
    *
    +-----------------------------------------------------------------*/
    constructor()
    {
        this.#onPush = new SimpleEvent();
        this.#onHold = new SimpleEvent();
        this.#onPull = new SimpleEvent();
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: ボタン押下イベントを発火する.
    *
    +-----------------------------------------------------------------*/
    OnPush()
    {
        this.#onPush.Invoke();
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: ボタン長押しイベントを発火する.
    *
    +-----------------------------------------------------------------*/
    OnHold()
    {
        this.#onHold.Invoke();
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: ボタン解放イベントを発火する.
    *
    +-----------------------------------------------------------------*/
    OnPull()
    {
        this.#onPull.Invoke();
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 物理ボタン押下イベントを取得する.
    *
    * 戻り値:
    *   SimpleEvent: 物理ボタン押下イベント.
    *
    +-----------------------------------------------------------------*/
    GetPushEvent()
    {
        return this.#onPush;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 物理ボタン長押しイベントを取得する.
    *
    * 戻り値:
    *   SimpleEvent: 物理ボタン長押しイベント.
    *
    +-----------------------------------------------------------------*/
    GetHoldEvent()
    {
        return this.#onHold;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 物理ボタン解放イベントを取得する.
    *
    * 戻り値:
    *   SimpleEvent: 物理ボタン解放イベント.
    *
    +-----------------------------------------------------------------*/
    GetPullEvent()
    {
        return this.#onPull;
    }
}