/***********************************************************************
 *
 *   UI要素の状態を管理するクラス.
 *
***********************************************************************/

class UIElement
{
    #action;   // UIAction:   ボタン操作に対するイベント群.
    #relation; // UIRelation: 他のUIとの関係性を表すインスタンス.
    #state;    // UIState:    このUIの状態を表すインスタンス.


    /*-----------------------------------------------------------------+
    *
    * 説明: コンストラクタ.
    *
    * 引数:
    *   bool pushPositiveToBack: 自身が決定されたとき前のUIに戻るならtrue.
    *
    +-----------------------------------------------------------------*/
    constructor(pushPositiveToBack = false)
    {
        this.#action   = new UIAction();
        this.#relation = new UIRelation(pushPositiveToBack);
        this.#state    = new UIState(this.#relation);
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 他のUIとの関係性を表すインスタンスを取得する.
    *
    * 戻り値:
    *   UIRelation: 他のUIとの関係性を表すインスタンス.
    *
    +-----------------------------------------------------------------*/
    GetRelation()
    {
        return this.#relation;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: ボタン操作に対するイベント群を取得する.
    *
    * 戻り値:
    *   UIAction: ボタン操作に対するイベント群.
    *
    +-----------------------------------------------------------------*/
    GetAction()
    {
        return this.#action;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: このUIの状態を表すインスタンスを取得する.
    *
    * 戻り値:
    *   UIState: このUIの状態を表すインスタンス.
    *
    +-----------------------------------------------------------------*/
    GetState()
    {
        return this.#state;
    }
}