/***********************************************************************
 *
 * 　フィールドの 1 列を保持するためのクラス.
 *
***********************************************************************/

class BlockLine
{
    #blocks; // Array<Block> blocks;


    /*-----------------------------------------------------------------+
    *
    * 説明: コンストラクタ.
    *
    * 引数:
    *   number width: 行の横幅.
    *
    +-----------------------------------------------------------------*/
    constructor(width)
    {
        this.#blocks = [];
        for (let i=0; i<width; i++)
        {
            this.#blocks.push(new Block(0, true));
        }
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 指定の列にブロックを書き込む.
    *
    * 引数:
    *   number x:     列.
    *   Block  block: 書き込むブロック.
    *
    +-----------------------------------------------------------------*/
    Flush(x, block)
    {
        this.#blocks[x] = block;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 指定の列にブロックを書き込む.
    *
    * 引数:
    *   number x:     列.
    *   Block  block: 書き込むブロック.
    *
    +-----------------------------------------------------------------*/
    IsComplete()
    {
        for (let block of this.#blocks)
        {
            if (block.IsHidden()) return false;
        }
        return true;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: このブロック行を取得する.
    *
    +-----------------------------------------------------------------*/
    GetLine()
    {
        return this.#blocks;
    }
}