/***********************************************************************
 *
 * 　SRS のズラし情報を格納するためのクラス.
 *
***********************************************************************/

class RotatePadding
{
    #next;   // RotatePadding: 次のズラし情報.
    #volume; // Point:         ズラし情報.
    #end;    // bool:          最後の情報かどうか.


    /*-----------------------------------------------------------------+
    *
    * 説明: コンストラクタ.
    *
    * 引数:
    *   Point point: SRS ズラしの量.
    *   bool  end:   最後の状態なら true.
    *
    +-----------------------------------------------------------------*/
    constructor(point, end = false)
    {
        this.#volume = point;
        this.#end    = end;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 次の情報を変更する.
    *
    * 引数:
    *   RotatePadding next: 次の情報.
    *
    +-----------------------------------------------------------------*/
    ChangeNext(next)
    {
        this.#next = next;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 次の情報を取得する.
    *
    * 戻り値:
    *   RotatePadding: 次の情報.
    *
    +-----------------------------------------------------------------*/
    Next()
    {
        return this.#next;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 最初の情報を取得する.
    *
    * 戻り値:
    *   RotatePadding: 最初の情報.
    *
    +-----------------------------------------------------------------*/
    Begin()
    {
        if (this.#end) return this.#next;

        let padd = this.#next;
        while(!padd.#end) padd = padd.Next();
        return padd.Next();
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: 最後の情報を取得する.
    *
    * 戻り値:
    *   RotatePadding: 最後の情報.
    *
    +-----------------------------------------------------------------*/
    End()
    {
        if (this.#end) return this;

        let padd = this.#next;
        while(!padd.#end) padd = padd.Next();
        return padd;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: SRSの状態が最後なら true を返す.
    *
    * 戻り値:
    *   bool: SRSの状態.
    *
    +-----------------------------------------------------------------*/
    IsEnd()
    {
        return this.#end;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: SRSズラし量を取得する.
    *
    * 戻り値:
    *   Point: ズラし量.
    *
    +-----------------------------------------------------------------*/
    GetPaddingVolume()
    {
        return this.#volume;
    }
}