/***********************************************************************
 *
 * 　テトリミノの情報を保持するための構造体.
 *
***********************************************************************/

class TetriMino
{
    #block;  // Block:        このミノを構成するブロック.
    #origin; // Point:        このミノの中心点の座標.
    #points; // Array<Point>: このミノの形を表す座標の配列.


    /*-----------------------------------------------------------------+
    *
    * 説明: コンストラクタ.
    *
    * 引数:
    *   Block        block:  このミノを構成するブロック.
    *   Point        origin: このミノの中心点の座標.
    *   Array<Point> points: このミノの形を表す座標の配列.
    *
    +-----------------------------------------------------------------*/
    constructor(block, origin, points)
    {
        this.#block  = block;
        this.#origin = origin;
        this.#points = points;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: このミノを構成するブロックを取得する.
    *
    * 戻り値:
    *   Block: このミノを構成するブロック.
    *
    +-----------------------------------------------------------------*/
    GetBlock()
    {
        return this.#block;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: このミノの中心座標を取得する.
    *
    * 戻り値:
    *   Point: このミノの中心座標.
    *
    +-----------------------------------------------------------------*/
    GetOrigin()
    {
        return this.#origin;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: このミノの形を表す座標の配列を取得する.
    *
    * 戻り値:
    *   Array<Point>: このミノの形を表す座標の配列.
    *
    +-----------------------------------------------------------------*/
    GetPoints()
    {
        return this.#points
    }
}