/***********************************************************************
 *
 *   テトリミノを生成するための申込用紙の役割を果たすクラス.
 *
***********************************************************************/

class TetriMinoProperties
{
    #name;   // string:       テトリミノの名前.
    #block;  // Block:        テトリミノを構成するブロック.
    #origin; // Point:        テトリミノの中心座標.
    #points; // Array<Point>: テトリミノの形状を表す座標の配列.


    /*-----------------------------------------------------------------+
    *
    * 説明: コンストラクタ.
    *
    * 引数:
    *   string       name:   このミノの名前.
    *   Block        block:  このミノを構成するブロック.
    *   Point        origin: このミノの中心点の座標.
    *   Array<Point> points: このミノの形を表す座標の配列.
    *
    +-----------------------------------------------------------------*/
    constructor(name, block, origin, points)
    {
        this.#name = name;
        this.#block = block;
        this.#origin = origin;
        this.#points = points;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: このテトリミノの名前を取得する.
    *
    * 戻り値:
    *   string: このテトリミノの名前.
    *
    +-----------------------------------------------------------------*/
    GetName()
    {
        return this.#name;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: このテトリミノを構成するブロックを取得する.
    *
    * 戻り値:
    *   Block: このテトリミノを構成するブロック.
    *
    +-----------------------------------------------------------------*/
    GetBlock()
    {
        return this.#block;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: このテトリミノの中心座標を取得する.
    *
    * 戻り値:
    *   Point: このテトリミノの中心座標.
    *
    +-----------------------------------------------------------------*/
    GetOrigin()
    {
        return this.#origin;
    }


    /*-----------------------------------------------------------------+
    *
    * 説明: このテトリミノの形状を表す座標の配列を取得する.
    *
    * 戻り値:
    *   Point: このテトリミノの形状を表す座標の配列.
    *
    +-----------------------------------------------------------------*/
    GetPoints()
    {
        return this.#points;
    }
}